In [1]:
# Import libraries
import pandas as pd
import numpy as np

# Define the dataset file name
data_frame = 'car_sales.csv'

# Data preparation and cleaning

In [2]:
# Load the dataset into a DataFrame
df = pd.read_csv(data_frame)

# Standardize column headers to snake_case
df.columns = (
    df.columns
    .str.strip()  # Remove any leading or trailing whitespace
    .str.lower()  # Convert all characters to lowercase
    .str.replace(" ", "_")  # Replace spaces with underscores for consistency
)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23906 entries, 0 to 23905
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_id         23906 non-null  object
 1   date           23906 non-null  object
 2   customer_name  23905 non-null  object
 3   gender         23906 non-null  object
 4   annual_income  23906 non-null  int64
 5   dealer_name    23906 non-null  object
 6   company        23906 non-null  object
 7   model          23906 non-null  object
 8   engine         23906 non-null  object
 9   transmission   23906 non-null  object
 10  color          23906 non-null  object
 11  price_($)      23906 non-null  int64
 12  dealer_no      23906 non-null  object
 13  body_style     23906 non-null  object
 14  phone          23906 non-null  int64
 15  dealer_region  23906 non-null  object
dtypes: int64(3), object(13)
memory usage: 2.9+ MB

In [3]:
# Handle special cases: convert currency symbols "$" to "usd"
df.rename(columns={"price_($)": "price_usd"}, inplace=True)

df.head(1)

,car_id,date,customer_name,gender,annual_income,dealer_name,company,model,engine,transmission,color,price_usd,dealer_no,body_style,phone,dealer_region
0,C_CND_000001,1/2/2022,Geraldine,Male,13500,Buddy Storbeck's Diesel Service Inc,Ford,Expedition,DoubleÂ Overhead Camshaft,Auto,Black,26000,06457-3834,SUV,8264678,Middletown

In [4]:
# Convert the 'date' column to datetime format, setting invalid values to NaT
df['date'] = pd.to_datetime(df['date'], errors='coerce')

# Warn if any records could not be converted to datetime
if df['date'].isnull().sum() > 0:
    print('Warning: Some dates could not be parsed and have been set to NaT.')

# Display column info
df['date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 23906 entries, 0 to 23905
Series name: date
Non-Null Count  Dtype
--------------  -----
23906 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 186.9 KB

In [5]:
# Remove duplicate records (if any) from the DataFrame
df.drop_duplicates(inplace=True)

# Analyze the number of unique values for each column
df_info = (
    df.nunique()
    .to_frame(name="UniqueVal")
    .assign(MissingVal=df.isnull().sum())
    .assign(DataType=df.dtypes)
    .sort_values(by="UniqueVal", ascending=True)
)

print(df_info)

               UniqueVal  MissingVal        DataType
gender                 2           0          object
engine                 2           0          object
transmission           2           0          object
color                  3           0          object
body_style             5           0          object
dealer_no              7           0          object
dealer_region          7           0          object
dealer_name           28           0          object
company               30           0          object
model                154           0          object
date                 612           0  datetime64[ns]
price_usd            870           0           int64
annual_income       2508           0           int64
customer_name       3021           1          object
phone              23804           0           int64
car_id             23906           0          object

In [6]:
df.head(5)

,car_id,date,customer_name,gender,annual_income,dealer_name,company,model,engine,transmission,color,price_usd,dealer_no,body_style,phone,dealer_region
0,C_CND_000001,2022-01-02,Geraldine,Male,13500,Buddy Storbeck's Diesel Service Inc,Ford,Expedition,DoubleÂ Overhead Camshaft,Auto,Black,26000,06457-3834,SUV,8264678,Middletown
1,C_CND_000002,2022-01-02,Gia,Male,1480000,C & M Motors Inc,Dodge,Durango,DoubleÂ Overhead Camshaft,Auto,Black,19000,60504-7114,SUV,6848189,Aurora
2,C_CND_000003,2022-01-02,Gianna,Male,1035000,Capitol KIA,Cadillac,Eldorado,Overhead Camshaft,Manual,Red,31500,38701-8047,Passenger,7298798,Greenville
3,C_CND_000004,2022-01-02,Giselle,Male,13500,Chrysler of Tri-Cities,Toyota,Celica,Overhead Camshaft,Manual,Pale White,14000,99301-3882,SUV,6257557,Pasco
4,C_CND_000005,2022-01-02,Grace,Male,1465000,Chrysler Plymouth,Acura,TL,DoubleÂ Overhead Camshaft,Auto,Red,24500,53546-9427,Hatchback,7081483,Janesville

# Time series Analysis

In [14]:
import matplotlib.pyplot as plt

df_date_index = df.set_index('date')

In [24]:
df_date_index.loc['2022-01-02'].describe()

       annual_income     price_usd         phone
count   3.500000e+01     35.000000  3.500000e+01
mean    6.635357e+05  25207.142857  7.448357e+06
std     5.478667e+05  14091.153581  7.492251e+05
min     1.350000e+04   9000.000000  6.183219e+06
25%     1.117500e+05  15500.000000  6.845298e+06
50%     6.850000e+05  21000.000000  7.558767e+06
75%     8.650000e+05  31125.000000  7.956948e+06
max     2.500000e+06  82000.000000  8.847858e+06